Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN PSYCHIC STUDIES.tmx
Source language: ko
Languages: en

source: 다른 방법으로 막았으면 막았지 이건 아닌 것 같단 말이야.
en: I’d try to stop you another way, but I don’t think this is it anymore.

source: 사람이 어떻게∙∙∙ ∙∙∙ 시험에 올인하니∙∙∙ ∙∙∙ .
en: how can anyone... rely only on exams?

source: 준비들 잘해라 ㅋ
en: heh. good luck studying, everyone.

source: 그럼 멈춰!!
en: then stop!

source: 고오오~
en: LOOM

source: 나 동아리 부실 정리하는 거 깜빡했다
en: I forgot. I need to go help my club clean up the room.

source: 이번…?
en: this... time?

source: 여의주 너 쟤한테 우선 가봐
en: hey, euijoo. you should go check on her.

source: 야, 이 ㄱ새꺄!!
en: stop, you moron!!!

source: 아빠!!
en: dad!!!

source: 이건 진주 몫!!!!
en: this is for pearl!!!!

source: 그럼…
en: then...

source: … 의주 오면 수업 마치고 00교실에서 보자고 좀 전해줄래?
en: when euijoo comes back... can you tell her I want to see her after class in the other classroom?

source: 아니면 확 옮겨버…
en: or should I just give you the cold...

source: 뭐야, 진짜였냐?
en: ha! was I right?

source: 피해!!
en: just run!!!

source: 그런 게 어디 있어!
en: there’s no such thing!

source: 제일 비싼 거
en: I want something super expensive.

source: 뭐하는 짓이야?!
en: what the hell are you doing?!

source: 뭐가??
en: why?!

source: 아리가토!
en: arigato!

source: 걔 아까부터 안 보여!
en: he’s been gone for a while now!

source: 아니라고
en: no.

source: 으아악!
en: aaagh!

source: 아…
en: oh...

source: 진주 그런 애 아닌 거 알잖아.
en: you know pearl isn’t the type to do something like that.

source: 헐 태남이?!
en: was it taenam?! no way!

source: …쯧.
en: tsk...

source: 어쩌면 양말 주인을 쉽게 찾을지도…?
en: I might find the socks’ owner pretty quickly!

source: 그래, 네가 있을 줄 알았어
en: ha, I knew you’d be here.

source: 아빠… 아빠도 죽을 때 이렇게 아팠을까…?
en: dad... did it hurt this much when you died too?

source: 아니, 아니야!!
en: no! no way!!!

source: 역시 넌 좋은 녀석이다 신아~!
en: I knew it. you’re a really good guy, shin!

source: 스륵…
en: SLIP

source: 생각해 보니까 미술실은 음악실 바로 옆…!
en: come to think of it, the art room is right next to the music room!

source: 근데… 니가 기억을 가지고 돌아갈 수 있다는걸 왜 나한테 알려주지?
en: but... why are you revealing to me that you can go back in time with all your memories?

source: 봉사 점수도 쌓이고 좋구만
en: you get community service credit.

source: 책은 또 어디서 가져온 거야…
en: where did that book come from?

source: 나도 같이 갈까?
en: or should I just go with you?

source: 용서해준다고는 안했다.
en: that doesn’t mean I’ve forgiven you, though.

source: 이런 걸 귀신한테 홀렸다고 하나?
en: the ghost must have bewitched them.

source: 아빠도 다칠 수도 있는데 굳이 나서서는…
en: you could’ve gotten hurt too, dad...

source: 그런데 너가 나랑 진주 사이에 대해서
en: but... are we close enough...

source: 너무 그러니까 나 엄살 부리는 것 같잖아~
en: you make me feel like I’m acting weak.

source: 유정아 언니!!
en: yujeong, so pretty!!!

source: … 미진이가 미친 거 같다
en: mijin must have lost it...

source: 날 뭘로 보는 거냐 ㅆㅂ
en: what do you bastards take me for?!

source: 그래 ㅂ신아 암튼,
en: okay, whatever. anyway...

source: 미정이 앞에선 도저히 나댈 수가 없어
en: I can’t act like everything’s cool in front of mijung.

source: 다… 나 때문이니까
en: it’s... all my fault.

source: 어쩔 수 없다 미정아!
en: we have no other choice, mijung!

source: 역시
en: right.

source: 거짓말이 아니라 정말 연애가 궁금할 수도 있는 거잖아
en: who cares if you’re just curious about dating?

source: 너도 독심술 쓰냐?
en: now you can read minds too?!

source: 언니한테 말해볼래?
en: why don’t you tell me?

source: 그게 왜?
en: and what’s wrong with that?

source: 윽...근데 좀 아프네?
en: ouch... it kinda hurts.

source: 뭐야 저 새끼…?
en: what’s with that fool...?

source: 없네… 잃어버렸나 봐 미안..
en: they’re not here... I must have dropped them somewhere. sorry...

source: ㅇㅇ
en: lol.

source: 4 미술 체육 영어
en: 4 Art PE English

source: 야, 야!!!
en: h-hey!!!

source: 무슨 일이…
en: what’s going on?

source: 닥쳐
en: shut up.

source: 뭐야?
en: who’s there?

source: 의도가 대체…!!!
en: what’s her goal?!!!

source: 용의 몸.
en: and its body.

source: 무슨 일 있었는지는 내가 물어보고 싶었는데…
en: I wanted to ask what was wrong...

source: 뿔에 해당하는 힘을 가지고 있어요
en: he has the power of the dragon’s horn.

source: 뭐지…?
en: what the...

source: 근데 너 방금 뭐 냄새 맡고 있지 않…
en: but weren’t you just sniffing somethi--

source: 아ㅋㅋㅋ 까인 거야?
en: oh, lol. so he turned you down!

source: 그래? …
en: is it?

source: 웅?
en: yes?

source: 이름:{j}김도윤
en: name: do-yoon kim{j}

source: 그런 것 보다라니… 난 그게 제일 중요하다고…
en: not important? that’s the most important thing to me...

source: 너도 그렇고 미정이도 그렇고, 의주랑 뭐해?
en: what are you and mijung doing with euijoo?

source: 기…김우찬…
en: w-woochan...

source: 역시 남치니가 최고라니까~
en: you’re the absolute best!!!

source: 우선은 모르는 척하고 있어봐
en: just pretend like you don’t know anything for now.

source: 아닌데
en: nope!

source: 알림2
en: Notice 2

source: 그래, 그런 것일 수도 있고
en: yeah, you might be right.

source: 니는 뭔데 너 같은 변ㅌ 최면 안경이 뭘 상담해줘
en: why are you here? what kind of help could a moron with ugly hypnotic glasses possibly give?

source: 저게∙∙∙ ∙∙∙ .
en: shut up...

source: 아… 이러면 남자 후보가 없는데…
en: uh... there aren’t any more guys...

source: 세상에 억울한 죽음은 한둘이 아냐
en: many people in the world die an unlucky death.

source: 으악!!
en: aaack!!!

source: 상담부의 연애 부서를 맡은 나의 생각에 따르면 넌 연애를 하고 싶기보단!
en: I’m in charge of dating advice! and in my opinion, you don’t really want to date anyone!

source: 의주처럼 생각을…
en: I said I want to read minds like euijoo--

source: 허어~ 이 자식 좀 보게~
en: ha! would you look at this kid!

source: 어쩌자고 이런… 이러다 큰일이라도 나면…
en: what if... something terrible happens?

source: 누군가… 온다…!
en: someone’s... coming!

source: 내가 뭔가 놓치고 있는 느낌이야.
en: like I’m forgetting something important?

source: 나를 좋아하란 최면은 먹힌다!
en: hypnotizing her to like me works!

source: 뭐야 나 방금 무슨…!
en: what did I just-!

source: 니가 그렇게 중요하게 생각하는 능력 같은 거,
en: that super power you think is so important...

source: 이미 현재 시점에서 경험한 일이라면 더 그렇고.
en: ...even if it’s something you already experienced at the present moment.

source: 해보자고 계약 연애
en: the contract relationship. let’s try it.

source: 니가 그딴 생각이나 하니까 그렇지
en: it’s because your thoughts are sh*tty.

source: 김찬규…?
en: chankyu?

source: 수업 끝나고 보자고
en: see you after class.

source: 이제 좀 이해가 돼?
en: do you get it now?

source: 아아악!!
en: aargh!

source: 몰라서 묻냐?
en: you’re asking me?

source: 그걸 어떻게 찾냐고~!!!
en: how are we supposed to find him?!

source: ㅎㅎ
en: lol.

source: 능력을 다른 사람들도 다 있는 이런 곳에서 쓰겠다고?
en: they’re using their superpowers here? where all these people are?

source: 그건 절대!!
en: absolutely not!!!

source: 뭐∙∙∙ ∙∙∙ 이러고 다닌 걸 보니까 여유는 있나보네.
en: well... seeing you going around like this, you must be confident.

source: 이제라도 알았음 됐지
en: at least you know now...

source: 미래가 보였다…
en: I saw the futur--

source: 아니?
en: nope.

source: 저, 저… 아직도 최면에…
en: is she... still hypnotized...?

source: 걔네 친구지.
en: I’m their friend.

source: 임시 훈육소에서 교육을 받았다
en: so, my classes were held at a temporary training center.

source: 노력은 결코 배신하지
en: EFFORT always SHOWS

source: 어른들은 이런 말 하기를 쑥스러워해
en: adults are too shy to say certain words...

source: 38선이 터졌대요!
en: the 38th parallel was breached!

source: 슬슬 저쪽도 손을 써봐야 하나
en: maybe I need to do something about them as well.

source: 아니 미국이 아니라~ 하늘나라… 암튼 저 위에 계실 텐데!
en: no, not overseas! to the stars... anyway, he’s probably up there!

source: 뭐야 왜 너 나 싫다면서
en: ha... I thought you didn’t like me.

source: 얼마든지 바꿀 수 있어!!
en: is something I can change!!!

source: 어쨌든 진짜 고마워.
en: still, thanks. really.

source: 이미 다 넘어온 거나 다름없으니까
en: she’s pretty much on my side now.

source: 어떡하지?!
en: what do I do?!

source: 진짜 쩐다!!
en: that’s so cool!!!

source: 저 귀신을 빨리 없애야 되겠어
en: I should get rid of that ghost quickly.

source: 무대 순번 3번째인데 어쩌지 기껏 준비한 건데…
en: we’re the third to go on stage. what should we do? they were so hard to get...

source: 그것도… 사리사욕을 위해서?
en: for... their own greed?

source: 어, 영준아 오늘부터 새로 1학년 한 명…어!
en: hey, youngjun. a new first-year student is joining us- oh!

source: 여러 사람들을 구하고 치료하면서 힘든 일을 잔뜩 겪었지만
en: while saving and treating many people, I went through all kinds of trouble myself.

source: 귀신까지 도와준 거였다고?
en: the ghost helped too?

source: 생각만으로 자기 최면이 된 건가…
en: did I hypnotize myself just by thinking that?

source: 자, 이게 마지막이다~
en: this is the last one, everyone.

source: 씨ㅂ?
en: you b*tch!

source: 같이 갈래?
en: wanna come with us?

source: 귀… 귀신아…?
en: h-hey... ghost?

source: 나 때는 왜 들어왔냐더니!!
en: when I came, you argued that I should quit!!!

source: 꺄~>0<
en: yay!

source: 듣고 있는 거야?
en: you listening?

source: 둘이 괜찮을 때로 시간을 돌려도… 이야기해주지 않으면 난 몰라
en: even if I turn time back to when you two were on good terms... I still won’t know if you don’t tell me.

source: 아~ 이거…
en: oh, right...

source: 근데 뭐 입지∙∙∙ ∙∙∙ .
en: but what should I wear...?

source: 누가 퍼자래?
en: then you shouldn’t have been sleeping!

source: 아니, 그건 걔들이 꾸며준 거라 바로 티 나잖아!!!
en: no, they’re the ones who chose that outfit! it’ll be obvious!!!

source: 좋은쪽이든 나쁜쪽이든
en: whether they are good or bad.

source: 선생님 교과목 수행으로 바꿔요 그냥
en: teacher, you should change your major to assessment tests

source: 생각해 보니까 또 휘말려서 좋을 일도 없겠더라고?
en: after some thought, I realized I have nothing to gain by getting involved again.

source: 김태남(17) 의리 보이
en: taenam kim, 17 years old, loyal kid

source: 흐흐흐..
en: HEHEHE

source: 알림 2 알림 3
en: Notice 2 Notice 3

source: 조심해…
en: be careful...

source: 괜히 같이 논다고 했나 봐 ㅜ
en: I shouldn’t have hung out with him...

source: 네 말대로 죽는 건 죽는 걸로 끝이지
en: as you said, death should just end with death.

source: 그런 말을 하는 걸 보니까 반복시키는 게 확실히 니 능력인가보지..?
en: based on what you said, yours must be the ability to make others repeat something...

source: 알았어!
en: all right!

source: 광역딜 오지네..
en: why are they so loud?

source: 네가 어떻게…?
en: how did you...?

source: 누가 온다는 건데?
en: who is it?

source: 나~
en: I want...

source: 아 됐다 이제 괜찮아!
en: oh, there we go. I’m all good now!

source: 5 영어 국어 음악 도덕 체육
en: 5 English Korean Music Ethics PE

source: 이 새끼가 돌았나…?
en: you’re screwed, bastard.

source: 흐끄흑…윽…
en: hrrk... gag...

source: 이거 혹시…!
en: this might be-!

source: 미진이 말이 맞아.
en: mijin, you’re right.

source: 어, 당연하지!
en: oh, of course!

source: 미화 부는 무슨 활동을 할까?
en: I wonder what the beautification club will do...

source: 니가 진짜 그런게 궁금했으면 그냥 해보면 될 일이지
en: if you were that curious, you could’ve just asked yourself.

source: 하지만
en: but...

source: 벽보고 서있어!!
en: go stand there with your face to the wall!!!

source: 뭐야, 저것들
en: what are they doing?

source: 호랑이 굴에 들어가도 정신만 차리면 정신차린 시체가 된다.
en: in a tiger’s den, the one who keeps his head together will become a dead body with his head intact.

source: 그러고 보니 나, 무슨 부지?
en: wait a minute... what club was I in again?

source: 아!!
en: ow!!!

source: 하핫
en: HAHA

source: 물론 사소한 건 바뀔 수 있지만 기억을 못 하니 큰 건 못 바꿔
en: minor things may change, of course, but since they don’t remember, they can’t make any big changes.

source: 안돼… 제발
en: I can’t... please.

source: 황
en: ents

source: 아까 느껴보셨겠지만 용의 뿔은 다른 사람들의 능력을 증폭시켜 줄 수 있어요
en: I’m sure you felt it as well, but the dragon’s horn has the ability to amplify other people’s powers.

source: 짜악
en: SMACK

source: 됐나?!
en: did it work?!

source: 진짜로 ㄷ∙∙∙ ∙∙∙ .
en: is it really a da--

source: 난 사실
en: I’m actually...

source: 하, 하지만 그건 안돼…요
en: b-but I have to... master.

source: 이신… 스스로도 알고 있는 거야
en: shin knows it too...

source: 6·25전쟁 때 돌아가셨어
en: ...when the korean war broke out.

source: 오우 미안, 난 신경 써야 할 친구들이 많아서 말이야
en: oh, sorry. I have a lot of friends to take care of.

source: 동아리에서 만난거지 뭐
en: so we met there, duh.

source: 여자는 안돼!?
en: can you turn into a girl?!

source: 미정아.
en: mijung.

source: 밴드라도 붙이게!!
en: there should be bandages there!

source: 어디 간 거야~ ㅜㅜ
en: where’d they go?!

source: 양말…?
en: socks?

source: 넌 이미 알고 있단다
en: you already know them.

source: 마저 이야기하자면, 아까 그 사람은
en: oh, one more thing. that guy from earlier...

source: 속이 다 시원하네.
en: now I finally feel better.

source: 지금이다 미정아!!
en: mijung, now!

source: 어차피 너가 빙의해서 살린건데 지가 살린 줄 알잖어
en: you’re the one who possessed the girl and saved her, but he thinks he’s the hero.

source: 용의 눈은 능력자들을 한곳으로 모으는 힘이 있어요
en: ...which has the ability to bring people who have superpowers together.

source: 뭘…
en: what...?

source: 오늘도 내가 시합 이겨서 기분 좋으니까 봐주는 거다?약속 또 까먹으면 주거~
en: fine. I’m in a good mood since I won again today, so I’ll let you off the hook. don’t forget next time!

source: 지X...
en: jack*ss...

source: 여친 생일 기념 겸 남치니가 오늘 밥 쏜다 ^ㅗ^~
en: besides, it’s my girl’s birthday! so as her boy, I should be treating her! hehe.

source: 오…
en: oooh...

source: 일단 들어봐요!
en: just hear me out, okay?!

source: 도,도망쳐요!!
en: m-master, run!!!

source: 귀신의 속도가 내 예지 속도를 뛰어넘고 있어!!
en: the ghost is moving faster than I can predict!!!

source: 능력을 사용해서 돌아가봤자 둘 다 기억 못하니까.
en: even if she uses her super power to send you back in time, neither of you will remember.

source: 다들 그러드라ㅎ
en: so everyone says, heh.

source: 어, 미래 보는 병ㅅ새끼네 ㅋㅋ
en: look, it’s the douchebag that sees the future, lol.

source: 신경 쓰여?
en: were you concerned?

source: 시간을 돌리는 능력이라면서 뭐 하나 하는 거 없이…
en: I have the ability to turn back time, but I haven’t done a single thing...

source: 나랑 일주일 동안 만나보는 게 어때?
en: how about seeing me for a week?

source: 우우우-
en: BOOOO

source: 야, 김찬규-!!!!
en: hey, chankyu-!!!!

source: … 내 능력도 알고 있고…
en: so, you know my super power.

source: 나 학생 상담부
en: the peer counseling club.

source: 따로 고맙다고 안 해도 돼.
en: so you don’t have to thank her.

source: 이유는 모르겠지만!!
en: I don’t know why!!!

source: 갈 거면 같이 가자
en: let’s go together.

source: 솔직히 깻잎논쟁 하나도 뭔소린지 모르겠으면 개추
en: if you honestly have no idea what the “perilla leaf” debate is, subscribe.

source: 음∙∙∙ ∙∙∙ .
en: yeah...

source: 조심히 가?
en: get home safe, okay?

source: 혹∙∙∙ ∙∙∙ 혹시 수행평가는∙∙∙ ∙∙∙ .
en: wh-what about... the assessment...?

source: 나도…!
en: me too!

source: 뭣!?!!
en: what?!!!

source: 난 그냥 최면만 걸었는데?
en: I only hypnotized the ghost!

source: 이번엔 내가 얘기 들어줄게
en: I’ll listen to you this time.

source: 혜진
en: hyejin

source: 진주 남자친구 계속하면…
en: if I continue being pearl’s boyfriend...

source: 네가 무슨 생각을 하고 있는진 모르겠는데,
en: I don’t know what you’re thinking...

source: 네 맘대로 생각해
en: you’re entitled to your own opinion.

source: 사람은 이성으로만 살아갈 수 없다.
en: people cannot always be rational in life.

source: 여의주는 생각을 읽을 수 있잖아…!
en: euijoo can read minds!

source: 그러고보니, 얼굴도 엄청…
en: and her face, too...

source: 여기, 여기 .
en: over here.

source: 그래… 내 능력은 믿을게 못돼
en: so... my super power can’t be trusted.

source: 미래를 봤거든
en: I saw the future.

source: 뭐가 역시야?
en: about what?

source: 방금 뭔가 꺼림칙한 소리가…
en: I just heard something bloodcurdling...

source: 네~
en: okay.

source: 아, 알면 잘하라고~∙∙∙ ∙∙∙ .
en: s-so be good to me... got it?

source: 퍽퍽
en: THWUCK THWACK

source: 야, 여의주 너
en: hey, euijoo.

source: 난 이해림이야.
en: I’m haerim lee.

source: 개소리 좀 적당히 해…
en: enough of your nonsense...

source: 움찔!
en: TWITCH

source: 아까까진 있었는데…
en: she was here just a moment ago...

source: 이신은 이런 새끼라고.
en: what kind of jerk shin is?

source: 다쳤니?!
en: did you get hurt?!

source: 조심해
en: be careful.

source: 김찬규…세상에…
en: chankyu kim... my goodness...

source: ㅇㅈ 대체 누가 그린겨
en: right? who the hell drew that?

source: 원래 진주의 다리 상태 대로라면 절대 도달하지 못했을 점수에도 닿아보게 해줬지
en: her leg was already in terrible condition, but I enabled her to move up the tournament despite that.

source: 다…
en: ...ter.

source: 어… 으, 응…
en: uh... o-okay...

source: 알려줘서 고마워.
en: thanks for letting me know.

source: 내가 부탁해서 미정이 능력으로 한 시점을 계속 반복했었어.
en: I asked mijung to use her super power to keep repeating a particular moment in time.

source: 너 설마 또 ㅌ..
en: you couldn’t have--

source: 이 여자애… 춤추다가
en: while this girl is dancing...

source: 뭐해 너네?
en: what the hell are you two doing?

source: 내 예지로는
en: based on my prediction--

source: 보기 싫다… 진짜…
en: this is really... making me sick...

source: 학급 시간표
en: Schedule

source: 제가 언제요
en: when did I say that?

source: 알자나~ 나 어릴 때 아킬레스건 나가서 가끔 이런 거
en: it’s nothing. you already know... this happens now and then because I hurt my achilles tendon when I was younger.

source: ㅋ아하~ 본인이 어느정도 위치인지가 궁금한거지?
en: pfft. you must be curious where your place is.

source: ∙∙∙ 너튜브나 볼까∙∙∙ ∙∙∙ .
en: should I watch some newtube vids?

source: 위!!
en: look up!

source: 이거야!
en: this one!

source: 와 웃으면서…!
en: you say that with a smile?!

source: 내 친구는 내가 제일 잘 알아
en: he’s my friend. I’ll take care of my own business.

source: ㅆ발!!
en: d*mn it!!

source: 이거 진짜 맛있어!!
en: this is really good!!!

source: 나도 모르게 그만…!
en: I didn’t realize-!

source: 저 단발머리한테 빙의해 줘!
en: go possess that girl with short hair!

source: 그 짧은 틈에 난…
en: I subconsciously thought...

source: 엄마는 그동안 온갖 고생을 다 하셨다
en: meanwhile, my mom went through all kinds of struggles.

source: 네
en: you will...

source: …허억!!
en: gasp!!!

source: 왜 이럴 때!!!
en: why now of all times?!!!

source: 아냐, 어제부터 다른애 새로 사귄대
en: I heard he got a new girlfriend yesterday.

source: 저 새끼 진짜였던 거야?
en: so that fool is the real deal?

source: 아빠가 다친 게 그렇게 속상했어?
en: are you upset because daddy got hurt?

source: 다행이다ㅠㅜ 미안, 나 먼저 갈게!
en: that’s a relief. sorry guys, I’m gonna go first!

source: 탈탈
en: BRUSH BRUSH

source: 으아앙!!
en: ooow!!!

source: 아, 진짜~~!
en: geez, shin!!!

source: 난 문신은 별로…
en: tattoos don’t really impress me...

source: 응…
en: um...

source: 이 ㄱ새끼들아!
en: you morons!

source: 니 그 이상한 머리한 친구한테 전화 좀 해봐!
en: call your friend, the one with the weird hair!

source: 넌 뭘로 여기 오게 된거야?
en: what help do you give in this club?

source: 어∙∙∙ 어어∙∙∙ ∙∙∙ .
en: oh... okay...

source: 얍삽하긴
en: weaselly little thing.

source: 2D랑?
en: a game character?

source: 맞아 우리 부는 에이드 팔아
en: yeah, my club is selling beverages.

source: 아… 그, 그건…!
en: oh... th-that...

source: 네가 남잖아
en: there’s you.

source: 헐~~!!
en: whoaaa!!!

source: 솔직하게 말하고 줘도…
en: ...if I just come clean and give them to her.

source: 하하
en: haha.

source: 썩 완성된 능력은 아닌가 봐?
en: I guess your super power isn’t entirely effective, huh?

source: 이거… 내가 직접 가져다줘도 되는 거야…?
en: is this... something I can take there myself?

source: 그래, 지금까지 쭉 그랬지.
en: this is how we’ve always been, after all.

source: 냄새 맡고 있었다고 오해받으면 나는 사회적으로 매장이다…!!
en: if he thinks I was sniffing them... I’ll be doomed for life!!!

source: 그렇게 말할 땐 대부분 별 일 있는 거더라
en: usually, when someone says that, there’s something wrong.

source: 우린 한 몸이잖아!
en: we’re a team!

source: 남은…
en: ...is for--

source: 너도 계속 볼 수 있는 건가?
en: can I keep seeing you too?

source: 저벅 저벅
en: STEP STEP

source: 방법은…!
en: a way...

source: 그…그렇지?
en: I-I guess?

source: 아버지를 닮아가던 나는 가슴에 묻어둔 아빠를 다시 떠올리기 시작했다
en: the more I helped others, just like my father did, the more I thought of him and how I buried him in my heart.

source: 너 어제부터 좀 이상…
en: you’ve been a bit strange since yester...

source: 그치 미정아?
en: right, mijung?

source: 너!!
en: you!!!

source: 여기 꼴등 상품 초콜릿~ㅋㅋ
en: here’s a chocolate bar, hehe.

source: 이건 누가 봐도 여자 양말…!
en: it’s obvious that these socks belong to a girl!

source: 인력이 부족하다나봐
en: they say they need more people.

source: 됐어…
en: forget it!

source: 사귀어보지 않으면 모르잖아.
en: without dating experience, you wouldn’t know.

source: …너…
en: you...

source: 괜찮아
en: okay.

source: 어쩐지 안 보인다 했더니 이런 속셈이었나-
en: no wonder I couldn’t see her recently. is this what you all were up to?

source: 줄이기가 가능한거다!
en: he’s able to weaken another person’s super power!

source: 뭐여 미친놈아
en: what the hell is he singing?

source: 이 냄새는…!
en: this scent!

source: 너 설마 안 냈어?
en: did you forget to turn yours in?

source: 아니 ㅅ발 축제날이면 좀 즐기게 해달라고…
en: I mean, sh*t! it’s a festival! let me enjoy it at least...

source: 진주라는 애 남친이야
en: he’s pearl’s boyfriend.

source: 사실 너…
en: because honestly, you’re...

source: 이 기분은 뭐지..{j}내가 뭔가 놓치고 있는 느낌이야.
en: why do I feel like I’m forgetting something important?{j}

source: 너네랑도 정산할 건 정산해야지.
en: I need to finish things with you two as well.

source: 난 괜찮은데…
en: I’m really fine...

source: 그만해
en: ...just stop.

source: 마침 딱!{j}좋기도 했고
en: actually, you have great timing!{j}

source: 엥…?
en: eh?

source: 노력은 결코 배신하지 않는다
en: EFFORT always SHOWS

source: 정말… 고마워…!
en: thank you... so much!

source: 너 진짜 미래가 보이냐?
en: can you really see the future?

source: 내가 분명히 미래를 봤다고!
en: I promise! I saw the future!

source: 미정인 능력을 마음대로 쓰는 게 아니고
en: mijung can’t use her super power however she wants.

source: 귀신, 하나만 물어보자
en: hey, ghost. let me ask you one thing.

source: 얘도 엄청 예쁘잖아…?
en: ...but she’s a really pretty girl, too!

source: 그냥 던져봐.
en: just throw out a comment.

source: 오해하지 마
en: don’t get the wrong idea.

source: 너인 줄 모르고…!
en: I didn’t know it was you!

source: 흠흠!
en: ahem!

source: 내가 찬규랑 있는게 이상해?
en: is it really weird that I’m with chankyu?

source: 그 할 일 없는 셔틀이 나였냐
en: ...that loser with tons of time on his hands... is me?

source: 용의 뿔.
en: its horn.

source: 뭐라고 하지…?
en: what should I say?

source: 근데
en: so...

source: 몇 번이나 도와줬었잖아
en: you’ve helped so much already.

source: 내일 몇시라고?
en: what time u goin tmrw?

source: 기분 나쁘네?
en: it’s offensive.

source: ∙∙∙ ∙∙∙ 의주야.
en: euijoo...

source: 뭐..?
en: what?

source: 애니만 봐도 알 수 있어
en: there’s no doubt.

source: 난 너네한테 빙의능력 있다는 걸 말해준 적 없거든
en: I never told you guys that I can possess anyone’s body.

source: 좋아!
en: great!

source: ㅠ ㅜ
en: b n

source: 아하하, 진짜 그랬어~?
en: ahaha! you really did that?

source: 나 거짓말쟁이 맞아 처음부터 그랬어
en: I’m a liar. I lied from the start.

source: 그게 중요해?!
en: why is that important?!

source: 아니, 그런 건 아니구…
en: no, nothing happened...

source: 아니.
en: no.

source: 잠깐
en: wait.

source: 세상에나…
en: oh dear...

source: 그 둘은 같이 있는 편이 서로에게 좋을 거예요
en: it’s better for the two if they are together.

source: 그래서
en: so.

source: 그래서 그래…?
en: is that why?

source: 아빠…
en: dad...

source: ㅋㅋㅋ…
en: hahaha.

source: 아아악!
en: aaaahhh!

source: 좋아하는 애 있어?!
en: is there a boy you like?!

source: 그…
en: um...

source: 왜 또 폼은 잡고 난리야;;
en: why are you pretending to be cool again?

source: 어떻게…!!
en: do something!!!

source: 난…
en: I...

source: 너부터 뒈지고 싶어?
en: you wanna die first?

source: 이름은.
en: my name...

source: 그 사이에 또 영력이 엄청나게 증가했어…
en: his spiritual energy got even stronger... again.

source: 넌 꺼져봐 좀
en: shut your trap.

source: 기다려봐…!!
en: wait!!!

source: 이 ㅈ만한 게… 아니지, 나이는 나보다 많겠지
en: you little punk... wait, you might be older than me.

source: 아핰핰핰핰ㅋㅋ
en: ahahahaha!!!

source: 고맙다!!
en: thanks!!!

source: 낙동강까지 피신을 갔다 아빠는 전쟁에 끌려가고, 우리 보고 건강히 기다리라고 했다
en: after we fled to the nakdonggang river, my dad got drafted into the war. he told us to be well and to wait for him.

source: …아니 잠깐
en: wait a sec...

source: 긴장하지 말고 평소대로…!
en: don’t be nervous! just do like you did during practice!

source: 펑
en: POOF

source: 뭐 한다고 이걸 물어봐서 내가∙∙∙ ∙∙∙ .
en: why did I even ask him?

source: 걍 빠지는 거 아니고?
en: all because you don’t think you can do anything.

source: 최면도 아니고 응?
en: I’m not hypnotized. right?

source: 망했어…
en: totally doomed...

source: 국가 유공자?
en: a national veteran?

source: 여기 돌려줄게.
en: here, I’ll give them back to you...

source: 도움
en: Assistants

source: 저기…
en: hi...

source: 뭐가…요?
en: what do you mean... master?

source: 의주야 말해봐.
en: euijoo, you tell me.

source: 그렇다니까!!;;
en: exactly!!!

source: 걔 쎄!!
en: but he’s strong!!!

source: 웃기지 마!!
en: shut up!!!

source: 사실 내가…
en: to be honest...

source: 당연하지!!
en: of course!!!

source: 이신… 네가 그렇게 나오겠다면 나도 방법이 있다고.
en: shin lee... if that’s how you’re gonna play, I have my ways too.

source: 학습 좀 했네.
en: you must have studied hard.

source: 미정아?
en: mijung!

source: 어쨌든!
en: anyway!

source: 왜…요?
en: what is it... sir?

source: 방송댄스부의! <투웰브>~!
en: it’s the dance club, performing twelve!

source: 싫은데...
en: hell no...

source: 어디 가…!
en: where are you going?!

source: 제대로 알지도 못하면서…
en: when you don’t even know the whole story?

source: 너의 능력을 증폭시킨다면 그것도 가능하겠지?
en: if I strengthen your super power, I should be able to remember, right?

source: 왜 김태희한테 붙어있어?
en: why did you attach yourself to taehee?

source: 아 뭔 또 수행이야∙∙∙ ∙∙∙ .
en: ugh, another assessment...

source: 웃기지도 않아.
en: ridiculous.

source: 무릎이 까졌네…
en: my knee’s scratched...

source: 1번 후보 김우찬-!!
en: number one, woochan kim!!!

source: ㅋㅋ 재밌잖아 ㅋㅋ
en: that’s ‘cause it’s fun! hahaha.

source: 울지만 말고ㅎ
en: instead of crying.

source: ㅋㅋ 너 입에 부스러기 묻었다
en: haha, you have crumbs on your face.
